// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
Console.WriteLine("Введите число a: ");
int a = Convert.ToInt32( Console.ReadLine ());
Console.WriteLine("Введите число b: ");
int b = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите число c: ");
int c = Convert.ToInt32(Console.ReadLine());
int max = a;
if (b>max) Console.WriteLine(max=b);
if (c>max) Console.WriteLine(max=c);
Console.WriteLine("max");
Console.WriteLine(max);